In [3]:
import pandas as pd
import numpy as np
pd.DataFrame([[1,2,3],[4,5,6,],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['가', '나', '다'])

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
data = {
    'name' : ['kim', 'lee', 'Park'],
    'age' : [24, 27, 34],
    'children' : [2, 1, 3]
}

In [8]:
pd.DataFrame(data)

   name  age  children
0   kim   24         2
1   lee   27         1
2  Park   34         3

In [9]:
df = pd.DataFrame(data)
df

   name  age  children
0   kim   24         2
1   lee   27         1
2  Park   34         3

In [10]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
df.colums

AttributeError: 'DataFrame' object has no attribute 'colums'

In [12]:
data = {
    'name' : ['kim', 'lee', 'Park'],
    'age' : [24, 27, 34],
    'children' : [2, 1, 3]
}
df = pd.DataFrame(data)
df

   name  age  children
0   kim   24         2
1   lee   27         1
2  Park   34         3

In [13]:
df.columns

Index(['name', 'age', 'children'], dtype='object')

In [14]:
df.values

array([['kim', 24, 2],
       ['lee', 27, 1],
       ['Park', 34, 3]], dtype=object)

In [15]:
df.dtypes

name        object
age          int64
children     int64
dtype: object

In [16]:
df.T

            0    1     2
name      kim  lee  Park
age        24   27    34
children    2    1     3

In [17]:
df

   name  age  children
0   kim   24         2
1   lee   27         1
2  Park   34         3

In [18]:
df.index = list('abc')
df

   name  age  children
a   kim   24         2
b   lee   27         1
c  Park   34         3

In [19]:
df['name']

a     kim
b     lee
c    Park
Name: name, dtype: object

In [21]:
type(df['name'])

pandas.core.series.Series

In [22]:
df[['name','children']]

   name  children
a   kim         2
b   lee         1
c  Park         3

In [23]:
df.rename(columns={'name':'이름'})

     이름  age  children
a   kim   24         2
b   lee   27         1
c  Park   34         3

In [24]:
df

   name  age  children
a   kim   24         2
b   lee   27         1
c  Park   34         3

In [26]:
df.rename(columns={'name':'이름'},inplace=True)

In [27]:
df

     이름  age  children
a   kim   24         2
b   lee   27         1
c  Park   34         3

In [28]:
df

     이름  age  children
a   kim   24         2
b   lee   27         1
c  Park   34         3

In [50]:
pd.DataFrame([['KFC', 1000, 4.5], ['McDonald',2000,3.9],['SchoolFood',2500,4.2]])

            0     1    2
0         KFC  1000  4.5
1    McDonald  2000  3.9
2  SchoolFood  2500  4.2

In [51]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [40]:
pd.DataFrame([[1,2,3],[4,5,6,],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
pd.DataFrame([['KFC', 1000, 4.5], ['McDonald',2000,3.9],['SchoolFood',2500,4.2]])

            0     1    2
0         KFC  1000  4.5
1    McDonald  2000  3.9
2  SchoolFood  2500  4.2

In [52]:
pd.DataFrame([['KFC', 1000, 4.5], ['McDonald',2000,3.9],['SchoolFood',2500,4.2]], columns = ['food', 'price', 'rating'])

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [55]:
Data = {
    ['KFC', 1000, 4.5], 
     ['McDonald',2000,3.9],
     ['SchoolFood',2500,4.2]],
    columns = ['food', 'price', 'rating']}
print(data)

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (3630423416.py, line 5)